In [38]:
import pandas as pd

deaths_df = pd.read_csv('data/choleraDeaths.tsv', sep='\t')
deaths_df.rename(columns = {'Date': 'Date', 'Attack': 'Daily Attacks', 'Death': 'Daily Deaths'}, inplace=True)
# deaths_df['Daily Attacks'].cumsum()

deaths_df.shape[0]

# attacks_cumul = deaths_df['Attack'].cumsum()
# deaths_cumul = deaths_df['Death'].cumsum()

# deaths_graph_df = deaths_df.copy()
# deaths_graph_df.insert(2, 'Cumulative Attacks', attacks_cumul)
# deaths_graph_df.insert(4, 'Cumulative Deaths', deaths_cumul)

# deaths_graph_df.columns

42

In [39]:
extra_info_dict = {
    'author': 'This visu',
    'tools': 'this'
}
extra_info_dict['author']

'This visu'

In [40]:
naples_df = pd.read_csv(
    'data/naplesCholeraAgeSexData.tsv',
    sep='\t',
    skiprows = 6)

naples_df

       age  male  female
0      0-1   8.2     8.9
1      2-5  14.0    14.7
2     6-10  12.1    11.2
3    11-15   7.8     7.1
4    16-20   7.2     7.2
5    21-40  12.1    11.8
6    41-60  13.7    12.9
7    61-80  20.5    20.5
8  over 80  39.6    37.8

In [41]:
census_df = pd.read_csv('data/UKcensus1851.csv', skiprows=3)
census_df

        age     male   female
0    0 to 9  2075391  2065096
1  10 to 19  1711664  1711627
2  20 to 29  1395091  1542876
3  30 to 39  1073914  1140383
4  40 to 49   810979   845260
5  50 to 59   560534   592970
6  60 to 69   351893   399019
7  70 to 79   166194   199326
8       80+    40772    55704

In [42]:
pd.read_csv('data/choleraPumpLocations.csv')

   -0.136668  51.513341
0  -0.139586  51.513876
1  -0.139671  51.514906
2  -0.131630  51.512354
3  -0.133594  51.512139
4  -0.135919  51.511542
5  -0.133962  51.510019
6  -0.138199  51.511295

In [43]:
pd.read_csv('data/choleraDeathLocations.csv', error_bad_lines=False)

b'Skipping line 79: expected 3 fields, saw 4\n'

     3  -0.13793  51.513418
0    2 -0.137883  51.513361
1    1 -0.137853  51.513317
2    1 -0.137812  51.513262
3    4 -0.137767  51.513204
4    2 -0.137537  51.513184
..  ..       ...        ...
243  3 -0.137108  51.514526
244  2 -0.137065  51.514706
245  1 -0.138474  51.512311
246  1 -0.138123  51.511998
247  1 -0.137762  51.511856

[248 rows x 3 columns]